_________________________________________________________________
Layer (type)       Output Shape    Param # 
=================================================================
c1 (Conv2D)        (None, 148, 148 896     
_________________________________________________________________
activation_6 (Acti (None, 148, 148 0       
_________________________________________________________________
max_pooling2d_4 (M (None, 74, 74,  0       
_________________________________________________________________
c2 (Conv2D)        (None, 72, 72,  9248    
_________________________________________________________________
activation_7 (Acti (None, 72, 72,  0       
_________________________________________________________________
max_pooling2d_5 (M (None, 36, 36,  0       
_________________________________________________________________
c3 (Conv2D)        (None, 34, 34,  18496   
_________________________________________________________________
activation_8 (Acti (None, 34, 34,  0       
_________________________________________________________________
max_pooling2d_6 (M (None, 17, 17,  0       
_________________________________________________________________
flatten_2 (Flatten (None, 18496)   0       
_________________________________________________________________
dense_3 (Dense)    (None, 64)      1183808 
_________________________________________________________________
activation_9 (Acti (None, 64)      0       
_________________________________________________________________
dropout_2 (Dropout (None, 64)      0       
_________________________________________________________________
dense_4 (Dense)    (None, 1)       65      
_________________________________________________________________
activation_10 (Act (None, 1)       0       
=================================================================
Total params: 1,212,513
Trainable params: 1,212,513
Non-trainable params: 0
_________________________________________________________________
