_________________________________________________________________
Layer (type)       Output Shape    Param # 
=================================================================
conv2d_44 (Conv2D) (None, 148, 148 896     
_________________________________________________________________
activation_28 (Act (None, 148, 148 0       
_________________________________________________________________
max_pooling2d_27 ( (None, 74, 74,  0       
_________________________________________________________________
conv2d_45 (Conv2D) (None, 72, 72,  9248    
_________________________________________________________________
activation_29 (Act (None, 72, 72,  0       
_________________________________________________________________
max_pooling2d_28 ( (None, 36, 36,  0       
_________________________________________________________________
conv2d_46 (Conv2D) (None, 34, 34,  18496   
_________________________________________________________________
activation_30 (Act (None, 34, 34,  0       
_________________________________________________________________
max_pooling2d_29 ( (None, 17, 17,  0       
_________________________________________________________________
flatten_8 (Flatten (None, 18496)   0       
_________________________________________________________________
dense_17 (Dense)   (None, 64)      1183808 
_________________________________________________________________
activation_31 (Act (None, 64)      0       
_________________________________________________________________
dropout_6 (Dropout (None, 64)      0       
_________________________________________________________________
dense_18 (Dense)   (None, 1)       65      
_________________________________________________________________
activation_32 (Act (None, 1)       0       
=================================================================
Total params: 1,212,513
Trainable params: 1,212,513
Non-trainable params: 0
_________________________________________________________________
