_________________________________________________________________
Layer (type)       Output Shape    Param # 
=================================================================
conv2d_41 (Conv2D) (None, 148, 148 896     
_________________________________________________________________
activation_23 (Act (None, 148, 148 0       
_________________________________________________________________
max_pooling2d_24 ( (None, 74, 74,  0       
_________________________________________________________________
conv2d_42 (Conv2D) (None, 72, 72,  9248    
_________________________________________________________________
activation_24 (Act (None, 72, 72,  0       
_________________________________________________________________
max_pooling2d_25 ( (None, 36, 36,  0       
_________________________________________________________________
conv2d_43 (Conv2D) (None, 34, 34,  18496   
_________________________________________________________________
activation_25 (Act (None, 34, 34,  0       
_________________________________________________________________
max_pooling2d_26 ( (None, 17, 17,  0       
_________________________________________________________________
flatten_7 (Flatten (None, 18496)   0       
_________________________________________________________________
dense_15 (Dense)   (None, 64)      1183808 
_________________________________________________________________
activation_26 (Act (None, 64)      0       
_________________________________________________________________
dropout_5 (Dropout (None, 64)      0       
_________________________________________________________________
dense_16 (Dense)   (None, 1)       65      
_________________________________________________________________
activation_27 (Act (None, 1)       0       
=================================================================
Total params: 1,212,513
Trainable params: 1,212,513
Non-trainable params: 0
_________________________________________________________________
